# ours_lfz_v3.yaml
nc: 10
reg_max: 1

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                 # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]         # 2 (P2)

  - [-1, 1, Conv, [256, 3, 2]]                # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]         # 4 (P3)

  - [-1, 1, Conv, [512, 3, 2]]                # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                # 6 (P4)

  - [-1, 1, Conv, [1024, 3, 2]]               # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]               # 8 (P5)

  - [-1, 1, SPPF, [1024, 5]]                  # 9

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 2, C3k2, [512, True]]                   # 12 (P4)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14
  - [-1, 2, C3k2, [256, True]]                   # 15 (P3)

  # ⭐ P3 -> P2（小物件關鍵）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 2], 1, Concat, [1]]                    # 17
  - [-1, 2, C3k2, [128, True]]                   # 18 (P2 high-res)

  # ⭐ LFZ_v3（重點）
  - [-1, 1, LFZ_v3, [32]]                       # 19

  # 🔥 Detect（穩定版：先不用 P5）
  - [[19, 15, 12], 1, Detect, [nc]]